---
kind: other
id: Methods.T:Autodesk.Revit.DB.CurveUV
source: html/6f8575e3-7a18-3fad-de05-345f00086e9d.htm
---
# CurveUV Methods

Returns a 3D curve lying in the XY plane in XYZ coordinates, representing the 2D curve with its UV coordinates identified with XY coordinates.